# GetRoofPrefStyle

## Description
Gets the Roof Style of the Roof Preferences.

```pascal
FUNCTION GetRoofPrefStyle : LONGINT;
```

```python
def vs.GetRoofPrefStyle():
    return LONGINT
```

## See Also
VS Functions:
SetRoofPrefStyle

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural